import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class GuideService {

  constructor() { }

  items = [
    {
      img: "../../assets/экран.png",
      title: "Удобная оплата",
      text: "Контролируйте все покупки прямо в приложении, выбирайте удобный способ расчета: можете оплатить услугу сразу или погасить общий счет за все в конце круиза"
    },
    {
      img: "../../assets/экран.png",
      title: "Удобная оплата 2",
      text: "Контролируйте все покупки прямо в приложении, выбирайте удобный способ расчета: можете оплатить услугу сразу или погасить общий счет за все в конце круиза"
    },
    {
      img: "../../assets/экран.png",
      title: "Удобная оплата 3",
      text: "Контролируйте все покупки прямо в приложении, выбирайте удобный способ расчета: можете оплатить услугу сразу или погасить общий счет за все в конце круиза"
    },
    {
      img: "../../assets/экран.png",
      title: "Удобная оплата 4",
      text: "Контролируйте все покупки прямо в приложении, выбирайте удобный способ расчета: можете оплатить услугу сразу или погасить общий счет за все в конце круиза"
    },
    {
      img: "../../assets/экран.png",
      title: "Удобная оплата 5",
      text: "Контролируйте все покупки прямо в приложении, выбирайте удобный способ расчета: можете оплатить услугу сразу или погасить общий счет за все в конце круиза"
    },
    {
      img: "../../assets/экран.png",
      title: "Удобная оплата 6",
      text: "Контролируйте все покупки прямо в приложении, выбирайте удобный способ расчета: можете оплатить услугу сразу или погасить общий счет за все в конце круиза"
    },
    {
      img: "../../assets/экран.png",
      title: "Удобная оплата 7",
      text: "Контролируйте все покупки прямо в приложении, выбирайте удобный способ расчета: можете оплатить услугу сразу или погасить общий счет за все в конце круиза"
    },
    {
      img: "../../assets/экран.png",
      title: "Удобная оплата 8",
      text: "Контролируйте все покупки прямо в приложении, выбирайте удобный способ расчета: можете оплатить услугу сразу или погасить общий счет за все в конце круиза"
    }
  ]
}
